pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6005.h
/* HSPLLCTL Control Bits */
#define PLLM                             (0xfc00)        /* PLL Multiplier */
#define PLLM_H                           (0x00fc)
#define PLLM0                            (0x0400)        /* PLL Multiplier */
#define PLLM0_H                          (0x0004)
#define PLLM1                            (0x0800)        /* PLL Multiplier */
#define PLLM1_H                          (0x0008)
#define PLLM2                            (0x1000)        /* PLL Multiplier */
#define PLLM2_H                          (0x0010)
#define PLLM3                            (0x2000)        /* PLL Multiplier */
#define PLLM3_H                          (0x0020)
#define PLLM4                            (0x4000)        /* PLL Multiplier */
#define PLLM4_H                          (0x0040)
#define PLLM5                            (0x8000)        /* PLL Multiplier */
#define PLLM5_H                          (0x0080)
#define PLLM_16                          (0x4000)        /* */
#define PLLM_16_H                        (0x0040)
#define PLLM_17                          (0x4400)        /* */
#define PLLM_17_H                        (0x0044)
#define PLLM_18                          (0x4800)        /* */
#define PLLM_18_H                        (0x0048)
#define PLLM_19                          (0x4c00)        /* */
#define PLLM_19_H                        (0x004c)
#define PLLM_20                          (0x5000)        /* */
#define PLLM_20_H                        (0x0050)
#define PLLM_21                          (0x5400)        /* */
#define PLLM_21_H                        (0x0054)
#define PLLM_22                          (0x5800)        /* */
#define PLLM_22_H                        (0x0058)
#define PLLM_23                          (0x5c00)        /* */
#define PLLM_23_H                        (0x005c)
#define PLLM_24                          (0x6000)        /* */
#define PLLM_24_H                        (0x0060)
#define PLLM_25                          (0x6400)        /* */
#define PLLM_25_H                        (0x0064)
#define PLLM_26                          (0x6800)        /* */
#define PLLM_26_H                        (0x0068)
#define PLLM_27                          (0x6c00)        /* */
#define PLLM_27_H                        (0x006c)
#define PLLM_28                          (0x7000)        /* */
#define PLLM_28_H                        (0x0070)
#define PLLM_29                          (0x7400)        /* */
#define PLLM_29_H                        (0x0074)
#define PLLM_30                          (0x7800)        /* */
#define PLLM_30_H                        (0x0078)
#define PLLM_31                          (0x7c00)        /* */
#define PLLM_31_H                        (0x007c)
#define PLLM_32                          (0x8000)        /* */
#define PLLM_32_H                        (0x0080)
#define PLLM_33                          (0x8400)        /* */
#define PLLM_33_H                        (0x0084)
#define PLLM_34                          (0x8800)        /* */
#define PLLM_34_H                        (0x0088)
#define PLLM_35                          (0x8c00)        /* */
#define PLLM_35_H                        (0x008c)
#define PLLM_36                          (0x9000)        /* */
#define PLLM_36_H                        (0x0090)
#define PLLM_37                          (0x9400)        /* */
#define PLLM_37_H                        (0x0094)
#define PLLM_38                          (0x9800)        /* */
#define PLLM_38_H                        (0x0098)
#define PLLM_39                          (0x9c00)        /* */
#define PLLM_39_H                        (0x009c)
#define PLL_LOCK                         (0x0001)        /* PLL Lock Status */
#define PLL_LOCK_L                       (0x0001)
#define PLL_LOCK_0                       (0x0000)        /* PLL is not running or not locked */
#define PLL_LOCK_1                       (0x0001)        /* PLL is locked */
#define PLL_LOCK_1_L                     (0x0001)
#define PLLINFREQ                        (0x0100)        /* PLL Input Frequency Selection. */
#define PLLINFREQ_H                      (0x0001)
#define PLLINFREQ_0                      (0x0000)        /* Input frequency is equal to 6MHz or lower than 6MHz */
#define PLLINFREQ_1                      (0x0100)        /* Input frequency is higher than 6MHz */
#define PLLINFREQ_1_H                    (0x0001)

/* HSPLLUSSXTLCTL Control Bits */
#define USSXTEN                          (0x0001)        /* USSXT Enable. */
#define USSXTEN_L                        (0x0001)
#define USSXTEN_0                        (0x0000)        /* Disable USSXT Oscillator */
#define USSXTEN_1                        (0x0001)        /* Enable USSXT Oscillator */
#define USSXTEN_1_L                      (0x0001)
#define XTOUTOFF                         (0x0100)        /* USSXT Buffered Output OFF */
#define XTOUTOFF_H                       (0x0001)
#define XTOUTOFF_0                       (0x0000)        /* Enable USSXT buffered output */
#define XTOUTOFF_1                       (0x0100)        /* Disable USSXT buffered output. Default. */
#define XTOUTOFF_1_H                     (0x0001)
#define OSCTYPE                          (0x0200)        /* Reserved */
#define OSCTYPE_H                        (0x0002)
#define OSCTYPE_0                        (0x0000)        /* Gating Counter Length: 4096. It is recommended to use this 
                                                            configuration for crystal resonators.  Note: the counter 
                                                            counts the oscillator clock, so total time can be calculated 
                                                            as Time = 4096 x 1/Oscillator Clock Frequency. */
#define OSCTYPE_1                        (0x0200)        /* Gating Counter Length: 512. It is recommended to use this 
                                                            configuration for ceramic resonators. Note: the counter counts
                                                            the oscillator clock, so total time can be calculated as Time 
                                                            = 512x 1/Oscillator Clock Frequency. */
#define OSCTYPE_1_H                      (0x0002)
#define OSCTYPE__XTAL                    (0x0000)        /* Gating Counter Length: 4096. It is recommended to use this 
                                                            configuration for crystal resonators.  Note: the counter 
                                                            counts the oscillator clock, so total time can be calculated 
                                                            as Time = 4096 x 1/Oscillator Clock Frequency. */
#define OSCTYPE__CERAMIC                 (0x0200)        /* Gating Counter Length: 512. It is recommended to use this 
                                                            configuration for ceramic resonators. Note: the counter counts
                                                            the oscillator clock, so total time can be calculated as Time 
                                                            = 512x 1/Oscillator Clock Frequency. */
#define OSCTYPE__CERAMIC_H               (0x0002)
#define OSCSTATE                         (0x0002)        /* Oscillator Status Bit. */
#define OSCSTATE_L                       (0x0002)
#define OSCSTATE_0                       (0x0000)        /* Oscillator is either not enabled or in the middle of start-up 
                                                            transition. */
#define OSCSTATE_1                       (0x0002)        /* Oscillator has started but is not stable yet. Wait for 
                                                            sufficient time for stabilization. */
#define OSCSTATE_1_L                     (0x0002)


/*****************************************************************************
 LCD_C Registers
*****************************************************************************/

#define __MSP430_HAS_LCD_C__                  /* Definition to show that module is available */
#define __MSP430_BASEADDRESS_LCD_C__ 0x0A00
#define LCD_C_BASE             __MSP430_BASEADDRESS_LCD_C__

sfr_w(LCDCCTL0);                              /* LCD_C control 0 */
sfr_b(LCDCCTL0_L);
sfr_b(LCDCCTL0_H);
sfr_w(LCDCCTL1);                              /* LCD_C control 1 */
sfr_b(LCDCCTL1_L);
sfr_b(LCDCCTL1_H);
sfr_w(LCDCBLKCTL);                            /* LCD_C blinking control */
sfr_b(LCDCBLKCTL_L);
sfr_b(LCDCBLKCTL_H);
sfr_w(LCDCMEMCTL);                            /* LCD_C memory control */
sfr_b(LCDCMEMCTL_L);
sfr_b(LCDCMEMCTL_H);
sfr_w(LCDCVCTL);                              /* LCD_C Voltage Control Register */
sfr_b(LCDCVCTL_L);
sfr_b(LCDCVCTL_H);
sfr_w(LCDCPCTL0);                             /* LCD_C port control 0 */
sfr_b(LCDCPCTL0_L);
sfr_b(LCDCPCTL0_H);
sfr_w(LCDCPCTL1);                             /* LCD_C port control 1 */
sfr_b(LCDCPCTL1_L);
sfr_b(LCDCPCTL1_H);
sfr_w(LCDCPCTL2);                             /* LCD_C port control 2 (256 segments) */
sfr_b(LCDCPCTL2_L);
sfr_b(LCDCPCTL2_H);
sfr_w(LCDCPCTL3);                             /* LCD_C port control 3 (384 segments) */
sfr_b(LCDCPCTL3_L);
sfr_b(LCDCPCTL3_H);
sfr_w(LCDCCPCTL);                             /* LCD_C charge pump control */
sfr_b(LCDCCPCTL_L);
sfr_b(LCDCCPCTL_H);
sfr_w(LCDCIV);                                /* LCD_C interrupt vector */
sfr_b(LCDCIV_L);
sfr_b(LCDCIV_H);
sfr_b(LCDM1);                                 /* LCD memory 1 */

sfr_b(LCDM2);                                 /* LCD memory 2 */

sfr_b(LCDM3);                                 /* LCD memory 3 */

sfr_b(LCDM4);                                 /* LCD memory 4 */

sfr_b(LCDM5);                                 /* LCD memory 5 */

sfr_b(LCDM6);                                 /* LCD memory 6 */

sfr_b(LCDM7);                                 /* LCD memory 7 */

sfr_b(LCDM8);                                 /* LCD memory 8 */

sfr_b(LCDM9);                                 /* LCD memory 9 */

